import {

} from "./types";

const initialState = {


    "К": [
        ['КОТ', 'КОНЬ', 'КАП-ЛЯ', 'КО-СА', 'КА-ФЕ', 'КУХ-НЯ', 'КА-МЕНЬ', 'КОЛ-БА-СА', 'КОМ-НА-ТА', 'КО-ЖА',],
        ['МОШ-КА', 'МО-ЛО-КО', 'МУ-КА', 'ЛУК', 'ЛОЖ-КА', 'ВЕТ-КА', 'ОК-НО', 'БУЛ-КА', 'БЕЛ-КА', 'БАЛ-КОН',],
        ['ЛУК', 'ВОЛК', 'ФИ-НИК', 'ЛАК', 'БЫК', 'МЕ-ШОК', 'ЩЕ-НОК', 'ВНУК', 'ПА-УК', 'ВЕ-НИК',],
        ['КУ-КУШ-КА', 'КО-ТЕ-НОК', 'КОШ-КА', 'КУ-БИК', 'КАК-ТУС', 'КО-ЛО-БОК', 'КА-КА-О', 'КО-ЛО-КОЛ', 'СКАЗ-КА', 'КО-КОШ-НИК',],
    ],
    "Л": [
        ['ЛУК', 'ЛАМ-ПА', 'ЛОБ', 'ЛОСЬ', 'ЛУГ', 'ЛАВ-КА', 'ЛО-ПА-ТА', 'ЛОЖ-КА', 'ЛИ-МОН', 'ЛУ-ЖА',],
        ['СТУЛ', 'СТОЛ', 'О-СЁЛ', 'У-ГОЛ', 'КО-ЗЁЛ', 'ПОД-ВАЛ', 'БО-КАЛ', 'ДЯ-ТЕЛ', 'БАЛ', 'ВОК-ЗАЛ',],
        ['БЕЛ-КА', 'ВИЛ-КА', 'СА-ЛАТ', 'МО-ЛО-КО', 'ВО-ЛО-СЫ', 'БАЛ-КОН', 'БЕЛ-КА', 'У-ЛЫБ-КА', 'БО-ЛО-ТО', 'ЗО-ЛО-ТО',],
    ],
    "С": [
        ['СА-НИ', 'СТА-Я', 'СА-МО-ЛЁТ', 'СОЛЬ', 'СУМ-КА', 'СА-ПОГ', 'СЛОН', 'СЫН', 'СЛО-ВО', 'СО-ЛО-МА',],
        ['ЛЕС', 'НОС', 'АВ-ТО-БУС', 'ПО-ЯС', 'АБ-РИ-КОС', 'РЫСЬ', 'ГУСЬ', 'ЛОСЬ', 'ХВОСТ', 'ЛИ-СА / ЛИС',],
        ['БУ-СЫ', 'ВЕ-СЫ', 'НО-СОК', 'ПИСЬ-МО', 'КОЛ-БА-СА', 'ЛИ-СА', 'НА-СОС', 'СКАЗ-КА', 'СТОГ СЕ-НА', 'КУСТ',],
       
    ],
    //"": [
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //],
        //"": [
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //],
        //"": [
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //],
        //"": [
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //],
        //"": [
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //    ['', '', '', '', '', '', '', '', '', '',],
    //],
};



const stateWords = (state = initialState, action) => {

    switch (action.type) {

        //case LETTERS_SELECT:
        //    return {
        //        ...state,
        //        letterSelect: action.payload
        //    };
        default:
            return state;
    }
}
export default stateWords